In [8]:
import boto3
from botocore.config import Config
from langchain.llms.bedrock import Bedrock
from langchain.embeddings import BedrockEmbeddings
import pprint
import streamlit as st
import logging 
import json
import os,sys
import re
sys.path.append('/home/sagemaker-user/demo/')
import time
import pandas as pd
import io
from boto_client import Clientmodules
from llm_basemodel2 import LanguageModel_titantext, LanguageModel
from athena_execution import AthenaQueryExecute
from vector_embedding_client_product import EmbeddingBedrock
from sql_formatter.core import format_sql
import importlib.util
import inspect
from src.utils import *


logger = logging.getLogger(__name__)
logger.setLevel(logging.DEBUG)
logger.addHandler(logging.StreamHandler())
session = boto3.session.Session()
bedrock_client = session.client('bedrock')
rqstath=AthenaQueryExecute()
comprehend_client = session.client('comprehend')
eb = EmbeddingBedrock()

eb_load = eb.load_local_vector_store(vector_store_path=r'/home/sagemaker-user/demo/vector_store_client_product/23072024121127.vs')
# eb_load = eb.load_local_vector_store(vector_store_path=r'/home/sagemaker-user/text-to-sql-for-athena/vector_store_client_product/22072024182912.vs')
# eb_load = eb.load_local_vector_store(vector_store_path=r'/home/sagemaker-user/text-to-sql-for-athena/vector_store/20062024133050.vs')
from inspect import cleandoc
class RequestQueryBedrock:
    def __init__(self):
        # self.model_id = "anthropic.claude-v2"
        self.bedrock_client = Clientmodules.createBedrockRuntimeClient()
        self.language_model = LanguageModel(self.bedrock_client)
        self.llm = self.language_model.llm
    def getEmbedding(self,user_query):
        vcindxdoc=eb_load
        documnet=eb.getSimilaritySearch(user_query,vcindxdoc)
        return eb.format_metadata(documnet)
        
    def generate_sql(self,prompt, max_attempt=2) ->str:
            """
            Generate and Validate SQL query.

            Args:
            - prompt (str): Prompt is user input and metadata from Rag to generating SQL.
            - max_attempt (int): Maximum number of attempts correct the syntax SQL.

            Returns:
            - string: Sql query is returned .
            """
            attempt = 0
            error_messages = []
            prompts = [prompt]

            while attempt < max_attempt:
                logger.info(f'Sql Generation attempt Count: {attempt+1}')
                logger.info(f'we are in Try block to generate the sql and count is :{attempt+1}')
                generated_sql = self.llm.invoke(prompt).content
                print(generated_sql)
                query_str = generated_sql.split("```")[1]
                query_str = " ".join(query_str.split("\n")).strip()
                query_str = query_str.replace('`','"')
                sql_query = query_str[3:] if query_str.startswith("sql") else query_str
                
                explanation = generated_sql.split("```")[2]
    
                
                
                # return sql_query
                syntaxcheckmsg=rqstath.syntax_checker(sql_query)
                if syntaxcheckmsg=='Passed':
                    logger.info(f'syntax checked for query passed in attempt number :{attempt+1}')
                    return sql_query,explanation
                else:
                    prompt = f"""{prompt}
                    This is syntax error: {syntaxcheckmsg}. 
                    To correct this, please generate an alternative SQL query which will correct the syntax error for Athena.
                    The updated query should take care of all the syntax issues encountered.
                    Follow the instructions mentioned above to remediate the error. 
                    Update the below SQL query to resolve the issue:
                    {sqlgenerated}
                    Make sure the updated SQL query aligns with the requirements provided in the initial question."""
                    prompts.append(prompt)
                    attempt += 1

            return sql_query,explanation

rqst=RequestQueryBedrock()

/opt/conda/lib/python3.11/site-packages/pydantic/_internal/_fields.py:132: UserWarning: Field "model_id" in BedrockBase has conflict with protected namespace "model_".

You may be able to resolve this warning by setting `model_config['protected_namespaces'] = ()`.
  warnings.warn(
/opt/conda/lib/python3.11/site-packages/pydantic/_internal/_fields.py:132: UserWarning: Field "model_kwargs" in BedrockBase has conflict with protected namespace "model_".

You may be able to resolve this warning by setting `model_config['protected_namespaces'] = ()`.
  warnings.warn(
athena client created
s3 client created !!
bedrock runtime client created
/home/sagemaker-user/demo/llm_basemodel2.py:33: LangChainDeprecationWarning: The class `BedrockEmbeddings` was deprecated in LangChain 0.2.11 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-aws package and should be used instead. To use it run `pip install -U :class:`~langchain-aws` and import as `from :class:`~langchain_aws import BedrockEmbeddings``.
  self.embeddings = BedrockEmbeddings(

Loaded vector store

bedrock runtime client created

In [10]:

def userinput(user_query):
    logger.info(f'Searching metadata from vector store')
    # vector_search_match=rqst.getEmbeddding(user_query)
    vector_search_match=rqst.getEmbedding(user_query)
    # print(vector_search_match)
    # details="It is important that the SQL query complies with Athena syntax.For date columns comparing to string , please cast the string input as date. It is important to not use alias for group by clause, if select has DATE_FORMAT then use DATE_FORMAT in the group by. It is also important to respect the type of columns: if a column is string, the value should be enclosed in quotes. If you are writing CTEs then include all the required columns. While concatenating a non string column, make sure cast the column to string. "
    
        
    # final_question = "\n\nHuman:"+details + vector_search_match + user_query+ "n\nAssistant:"
    final_question =f""" You are an AI assistant that converts natural language questions into SQL query complies with Athena syntax.
            Important notes: It is important that the SQL query complies with Athena syntax.
            For date columns comparing to string , please cast the string input as date. 
            It is important to not use alias for group by clause. 
            It is also important to respect the type of columns: if a column is string, the value should be enclosed in quotes. 
            If you are writing CTEs then include all the required columns. 
            While concatenating a non string column, make sure cast the column to string.
            
            Database tables information:
            {vector_search_match}

            User question: {user_query}

                """
    
    answer,explanation = rqst.generate_sql(final_question)
    return answer,explanation

In [26]:
sql,explanation = userinput('show me monthly income by client name and product level 2 for RD John Smith')

Searching metadata from vector store
Sql Generation attempt Count: 1
we are in Try block to generate the sql and count is :1

To answer this question, we'll need to join the client_info and product_income tables, filter for the specific RD, and then aggregate the income by client name and product level 2 on a monthly basis. Here's the SQL query that complies with Athena syntax:

```sql
WITH client_rd AS (
    SELECT client_id, client_name
    FROM client_product.client_info
    WHERE LOWER(rd_name) LIKE LOWER('%John Smith%')
)

SELECT
    ci.client_name,
    pi.product_level2,
    DATE_TRUNC('month', pi.summary_date) AS month,
    SUM(pi.income) AS monthly_income
FROM client_product.product_income pi
JOIN client_rd ci ON pi.client_id = ci.client_id
GROUP BY
    ci.client_name,
    pi.product_level2,
    DATE_TRUNC('month', pi.summary_date)
ORDER BY
    ci.client_name,
    pi.product_level2,
    month
```

This query does the following:

1. We create a CTE named `client_rd` to filter clients with RD John Smith. We use LOWER() function to make the comparison case-insensitive.

2. In the main query, we join the `product_income` table with our `client_rd` CTE.

3. We select the client name, product level 2, and use DATE_TRUNC to get the month from the summary_date.

4. We sum the income to get the monthly income.

5. We group by client name, product level 2, and month.

6. Finally, we order the results by client name, product level 2, and month for a clear presentation.

This query complies with Athena syntax and follows the important notes you provided:
- It uses LIKE with LOWER() for string comparisons.
- It doesn't use aliases in the GROUP BY clause.
- It respects column types (no quotes around non-string columns).
- It includes all required columns in the CTE.
Executing: Explain   WITH client_rd AS (     SELECT client_id, client_name     FROM client_product.client_info     WHERE LOWER(rd_name) LIKE LOWER('%John Smith%') )  SELECT      ci.client_name,     pi.product_level2,     DATE_TRUNC('month', pi.summary_date) AS month,     SUM(pi.income) AS monthly_income FROM client_product.product_income pi JOIN client_rd ci ON pi.client_id = ci.client_id GROUP BY      ci.client_name,     pi.product_level2,     DATE_TRUNC('month', pi.summary_date) ORDER BY      ci.client_name,     pi.product_level2,     month
 I am checking the syntax here
execution_id: 537d2d40-b0fb-4f84-9552-466bc462fc3b

syntax checked for query passed in attempt number :1

Status : {'State': 'SUCCEEDED', 'SubmissionDateTime': datetime.datetime(2024, 10, 5, 15, 26, 38, 371000, tzinfo=tzlocal()), 'CompletionDateTime': datetime.datetime(2024, 10, 5, 15, 26, 38, 959000, tzinfo=tzlocal())}

In [27]:
explanation

"\n\nThis query does the following:\n\n1. We create a CTE named `client_rd` to filter clients with RD John Smith. We use LOWER() function to make the comparison case-insensitive.\n\n2. In the main query, we join the `product_income` table with our `client_rd` CTE.\n\n3. We select the client name, product level 2, and use DATE_TRUNC to get the month from the summary_date.\n\n4. We sum the income to get the monthly income.\n\n5. We group by client name, product level 2, and month.\n\n6. Finally, we order the results by client name, product level 2, and month for a clear presentation.\n\nThis query complies with Athena syntax and follows the important notes you provided:\n- It uses LIKE with LOWER() for string comparisons.\n- It doesn't use aliases in the GROUP BY clause.\n- It respects column types (no quotes around non-string columns).\n- It includes all required columns in the CTE."

In [28]:
sql

" WITH client_rd AS (     SELECT client_id, client_name     FROM client_product.client_info     WHERE LOWER(rd_name) LIKE LOWER('%John Smith%') )  SELECT      ci.client_name,     pi.product_level2,     DATE_TRUNC('month', pi.summary_date) AS month,     SUM(pi.income) AS monthly_income FROM client_product.product_income pi JOIN client_rd ci ON pi.client_id = ci.client_id GROUP BY      ci.client_name,     pi.product_level2,     DATE_TRUNC('month', pi.summary_date) ORDER BY      ci.client_name,     pi.product_level2,     month"

In [29]:

def fetch_results(querygenerated):
    if querygenerated== 'Cannot Generate Query' :
        return  pd.DataFrame()
    else:
        return rqstath.execute_query(querygenerated)

In [30]:
result=fetch_results(sql)

checking for file :llm-athena-output/athena_output/a575d7b6-1b13-4d7b-ab57-0195477b1686.csv

Calling download fine with params /tmp/llm-athena-output/athena_output/a575d7b6-1b13-4d7b-ab57-0195477b1686.csv,llm-athena-output/athena_output/a575d7b6-1b13-4d7b-ab57-0195477b1686.csv

In [31]:
result

      client_name product_level2       month  monthly_income
0    Company ABC1           BACS  2023-07-01         61104.0
1    Company ABC1           BACS  2023-08-01         60096.0
2    Company ABC1           BACS  2023-09-01         60056.0
3    Company ABC1           BACS  2023-10-01         61517.0
4    Company ABC1           BACS  2023-11-01         60987.0
..            ...            ...         ...             ...
343   EasyJet PLC      Overdraft  2024-02-01         34069.0
344   EasyJet PLC      Overdraft  2024-03-01         36103.0
345   EasyJet PLC      Overdraft  2024-04-01         36558.0
346   EasyJet PLC      Overdraft  2024-05-01         34427.0
347   EasyJet PLC      Overdraft  2024-06-01         35069.0

[348 rows x 4 columns]

In [25]:
import pandas as pd
pd.set_option('display.float_format', str)
import matplotlib.pyplot as plt
from matplotlib import rcParams
rcParams.update({'figure.autolayout': True})
df = pd.DataFrame({
    'parent_name': ['EasyJet PLC', 'Parent Company ABC', 'Parent Company DEF', 'Parent Company GHI', 'Parent Company JKL', 'Parent Company UVW', 'Parent Company XYZ'],
    'month': ['2023-07-31', '2023-07-31', '2023-07-31', '2023-07-31', '2023-07-31', '2023-07-31', '2023-07-31'],
    'total_income': [34130, 31795, 138652, 37823, 63275, 57154, 122605],
    'total_balance': [3903510.0, 1971690.0, 41484300.0, 3431680.0, 16319600.0, 10335500.0, 18764600.0]
})

grouped = df.groupby('parent_name')['total_income'].sum()
grouped.plot(kind='bar')
plt.title('Total Income by Parent Company')
plt.xlabel('Parent Company')
plt.ylabel('Total Income')
plt.savefig('total_income_by_parent_company.png',dpi=100)
plt.show()